# TorsionalMomentOfInertia Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..TorsionalMomentOfInertia Property
StructuralSectionAnalysisParams Class See Also
---
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double TorsionalMomentOfInertia { get; set; }
```

Visual Basic
---
```text
Public Property TorsionalMomentOfInertia As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TorsionalMomentOfInertia {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace